Revit 2024 API
FabricationPartBrowserChangedEventArgs.GetFilteredSolutionsPartsTypeCounts Method
 Returns the active fabrication part type usage count in fitlered routing solutions.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IDictionary<ElementId, int> GetFilteredSolutionsPartsTypeCounts()
Visual Basic
Public Function GetFilteredSolutionsPartsTypeCounts As IDictionary(Of ElementId, Integer)
Visual C++
public:
IDictionary<ElementId^, int>^ GetFilteredSolutionsPartsTypeCounts()
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace